# 問題を解いていると、どの段階でfor文を使ったらいいのかわからなくなってきます。
lst = ['red', 'blue', 'green']
for i in lst:
    print(i)

# 反復（while文)・(for文)の使い分けについて
# sample codeを使いながら説明する
# メルカリの検索
# twitterのリサーチ

# for文とrange文について
for i in range(1, 11, 2):
    print(i)

# while文やfor文の中で、先にprint関数を使うのかcountをするのかなど順番がまだあやふやです。


# 演習問題において、問題を見た際にどの方法を使って解くべきが思いつきません。自力で解くことができた問題がほぼありませんでした。。。
# for文に関して、
# 　for 変数　in リストの「変数」には何を入れてもいいですか？
# 　例えば、for color in colors:の場合、「color」を「a」にしても問題ないのでしょうか。
# 演習問題　６章　exercise4
# sum = 0
# for num in range (1,50):
#     if num % 5 == 0:
#         sum += num
#     num += 1
# print(""1から50までの数字の中で、5の倍数の合計は"" + str(sum) + ""です。"")
# 上記のように解答と違う求め方で解きましたが、答えが225になってしまいます。解答にある求め方も含め、解説していただきたいです。"

# 第7章の演習5と、in演算子の使い方が分からなかった。
# "演習問題7章のexercise2が、何となく理解しましたが、あやふやです。
# max_value=number[0]は、for関数によって、max_value=number[1] →　max_value=number[2]・・・　と変化していくということでしょうか。"

# "7章exercise2:最大値の表し方
# 条件分岐全般



# 何を使ってどの順番で書くのかを思い出して、頭の中で整理してから手を動かすまでに時間がかかるのでついていくのが難しかったです。
# "説明が難しいのですが、リスト1とリスト2の中の共通の値を導き出したいときは直訳するとリスト1 in リスト2のようなニュアンスで覚えれば良いのでしょうか
# 伝わりづらい内容で申し訳ありません"

# 演習７の５に関して、どうすれば共通の数字を表示させるのかがわからなかった。


# 演習課題全般、頭がパンクしそうです

# "演習問題の、7-2のif以降の部分が答えを見たが、なぜそのようになるのかが分からなかった。
# また、教科書の6-6のfor分のfor以降の変数は、自分で突然定義するということでしょうか。
# 伝わりづらくて申し訳ないです。"
